function lab02_main
%=== Дисципліна: Основи обробки біомедичної інформації ===
%--- Лабораторна робота #2 ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З СІХ
%
% Використовуйте файли даних: 
% ecg117.dat - сигнал EКГ 
% ecg_2х60.dat - сигнал ЕКГ з мережевою перешкодою частотою 60 Гц
%----------------------------------------------------------

clear, clc, close all
disp('Лабораторна робота #2')
disp('ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З СІХ')
disp('Виконав: Соколова М.А., група БМ-461 ІІДС')

% === Завдання #1.1 ===
% Реалізація фільтру Хеннінга, обчислення АЧХ та ФЧХ
fs = 1000;
b = [1 2 1]/4;   % коефіцієнти різницевого рівняння 
a =1;
n = 512;  % кількість точок, що розраховуються
figure()
[h,w] = freqz(b,a,n); %АЧХ и ФЧХ
mag = abs(h);
phase = angle(h)*180/pi;
subplot(2,1,1), plot(w/(2*pi)*fs,mag), grid on
... введіть позначення осей графіків
title('АЧХ і ФЧХ фільтра Хеннінга'),
xlabel('Гц'), ylabel('Амплітуда')
subplot(2,1,2), plot(w/(2*pi)*fs, unwrap(phase)), grid on
xlabel('Гц'), ylabel('Фаза')

%=== Завдання #1.2 ===
% Обчислення нулів фільтру
disp('Нулі фільтра') 
x = roots(b); %нулі функції
disp(x)%осуществляет вывод значений указанной переменной или указанного текста в командное окно
% Нулі фільтра
%     -1
%     -1

%=== Завдання #1.3 ===
% Фільтрація ЕКГ, файл ecg117.dat
fs = 1000;
ecg =load('ecg117.dat'); %сигнал ЕКГ
ecg = detrend(ecg) %видалення постійної складової
ecgf = filter(b,a,ecg); %фільтрація сигналу фільтром
%t = 
figure()
subplot(2,1,1), plot( ecg), 
ylabel('Амплітуда, mrV')
title ('Невідфільтрований сигнал')
xlabel('Час, с')
xlim([1 500])
subplot(2,1,2), plot( ecgf), ylabel('Амплітуда, mrV') 
title ('Відфільтрований сигнал ЕКГ')
xlabel('Час, с')
xlim([1 500])

%=== Завдання #2.1 ===
%Реалізація фільтру поліноміального згладжування
fs = 1000
bp = [-3 12 17 12 -3]/35;% коефіцієнти різницевого рівняння
ap = 1;
n = 512 ;  % кількість точок, що розраховуються
figure()
[h,w] = freqz(bp,ap, n);
mag = abs(  h  );
phase =angle(h)*180/pi ;
subplot(2,1,1), plot(w/(2*pi)*fs,mag), grid on
title ('АЧХ фільтру')
subplot(2,1,2), plot(w/(2*pi)*fs, unwrap(phase)), grid on
title ('ФЧХ фільтру')
% Обчислення нулів фільтру
disp('Нулі фільтру') 
k = roots(bp);
disp(k)
% Нулі фільтру
%    5.2242 + 0.0000i
%   -0.7078 + 0.7064i
%   -0.7078 - 0.7064i
%    0.1914 + 0.0000i
% Карта нулів та полюсів фільтру
figure()
kk = zplane(k); %побудова карти нулів і полюсів
title ('Карта нулів та полюсів фільтру')
xlabel('Реальна частина')
ylabel('Уявна частина')


% === Завдання #2.2 ===
% %Фільтрація ЕКГ файл ecg117.dat з використанням фільтру 
% %поліноміального згладжування
ecg =load('ecg117.dat'); %сигнал ЕКГ
ecgf5 = filter(bp, ap, ecg);
figure()
subplot(2,1,1), plot(ecgf5)
title ('Відфільтрований ЕКГ сигнал')
xlabel('Час')
xlim([1 200])
subplot(2,1,2), plot(ecg)
title ('Невідфільтрований ЕКГ сигнал')
xlabel('Час')
xlim([1 200])

% === Завдання #2.3 ===
% %Порівняння властивостей згладжування сигналу фільтром Хеннінга 
% %і поліноміальним фільтром
figure()
b = [1 2 1]/4;
a = 1;
ecg =load('ecg117.dat');
ecgf = filter(b,a,ecg);
subplot(3,1,1), plot(ecgf), ylabel('Амплітуда') 
title ('Фільтр Хеннінга')
xlabel('Час')
xlim([1 200])
 
subplot(3,1,2), plot(ecgf5), ylabel('Амплітуда') 
title ('Поліноміальний фільтр')
xlabel('Час')
xlim([1 200])
 
subplot(3,1,3), plot(ecg), ylabel('Амплітуда')
title('Невідфільтрований сигнал')
xlabel('Час')
xlim([1 200])

% === Завдання #3.1 ===
br =[1 0.618 1] ;   % коефіцієнти різницевого рівняння 
ar =1 ;
n =512 ;  % кількість точок, що розраховуються
fs =200 ;
figure()
[h,f] = freqz(br, ar, n, fs);
mag = abs(h);
phase = angle(h)*180/pi;
subplot(2,1,1), plot(f/(2*pi)*fs,mag), grid on
title('АЧХ і ФЧХ режекторного фільтра'),
xlabel('Частота'), ylabel('Амплітуда')
subplot(2,1,2), plot(f/(2*pi)*fs,unwrap( phase)), grid on
xlabel('Частота'), ylabel('Фаза')
% Обчислення нулів фільтру
disp('Нулі режекторного фільтру') 
kr = roots(br);
disp(kr)
%  Нулі режекторного фільтру
%   -0.3090 + 0.9511i
%   -0.3090 - 0.9511i
% Карта нулів та полюсів фільтру
figure()
kkr = zplane(kr);
title('Карта нулів та полюсів фільтру')
xlabel('Реальна частина')
ylabel('Уявна частина')
% Побудова передавальної функції
H = filt (br, ar)
% H = 1 + 0.618 z^-1 + z^-2


% === Завдання #3.2 ===
% % Фільтрація сигналу ЕКГ (файл ecg2х60.dat) режекторним фільтром
fs = 250;
ecg = load('ecg2x60.dat');% сигнал ЕКГ
ecg = detrend(ecg);
ecgf = filter(br,ar,ecg);
t = 200     
figure()
subplot(2,1,1), plot( ecg), ylabel('Амплітуда') 
title ('Невідфільтрований ЕКГ сигнал')
xlabel ('Час')
xlim([0 200])
subplot(2,1,2), plot( ecgf), ylabel('Амплітуда') 
title ('Відфільтрований ЕКГ сигнал')
xlabel ('Час')
xlim ([0 200])

% === Завдання #4.1 ===
% % Дослідження властивостей диференціаторів
 N = 1
fs =250 
bd1 =[1 -1]; % коефіцієнти різницевого рівняння 
ad1 = 1
n = 500     % кількість точок, що розраховуються
figure()
[h1,w1] = freqz(bd1,ad1,n);
mag1 = abs(h1);
phase1 = angle(h1)*180/pi
subplot(2,1,1)
plot(w1/(2*pi)*fs, mag1),    grid on
title('АЧХ диференціатора №1')
ylabel('Амплітуда')
xlabel('Час')
subplot(2,1,2)
plot(w1/(2*pi)*fs, unwrap(phase1)), grid on
title('ФЧХ диференціатора №1')
ylabel('фаза')
xlabel('Час')

% N = 2
bd2 = [1 -1]/2;  % коефіцієнти різницевого рівняння 
ad2 = 1
n = 500       % кількість точок, що розраховуються
figure()
[h2,w2] = freqz(bd2,ad2,n);
mag2 = abs(h2);
phase2 = angle(h2)*180/pi
subplot(2,1,1)
plot(w2/(2*pi)*fs, mag2),    grid on
title('АЧХ диференціатора №2')
ylabel('Амплітуда')
xlabel('Час')
subplot(2,1,2)
plot(w2/(2*pi)*fs, unwrap(phase2)), grid on
title('ФЧХ диференціатора №2')
ylabel('фаза')
xlabel('Час')

% % Побудова передавальних функцій
H1 = filt (bd1, ad1)
H2 = filt (bd2, ad2)

% Отримуємо:
% H1 =1 - z^-1
% H2 =0.5 - 0.5 z^-1


% %=== Завдання #4.2 ===
% % Дослідження процесу диференціювання ЕКГ з шумом (файл ecg117.dat)
% % N = 1
fs = 250
ecg = load('ecg117.dat');% сигнал ЕКГ
ecgd1 = filter(bd1,ad1,ecg);
ecgd2 = filter(bd2,ad2,ecg);
figure()
subplot(3,1,1), plot(ecg), ylabel('Амплітуда') 
title ('Невідфільтрованиий ЕКГ сигнал')
xlabel('Час')
xlim([0 200])
subplot(3,1,2), plot(ecgd1), ylabel('Амплітуда')
title('Відфільтрований ЕКГ сигнал. Диференціатор №1') 
xlabel ('Час')
xlim([0 200])
subplot(3,1,3), plot(ecgd2), ylabel(' Амплітуда') 
title ('Відфільтрований ЕКГ сигнал. Диференціатор №2')
xlabel('Час')
xlim([0 200])
